Repository: jimregan/citizens-information-raw
Catalog: en-pl/www.citizensinformation.ie/pl/social_welfare/social_welfare_payments/unemployed_people/jobseekers_allowance.html.txt.tmx
Source language: en
Languages: pl

source: Fuel Allowance is payable to people who have been getting a jobseeker’s payment for 390 days, if they satisfy the relevant qualifying conditions
pl: • dodatku na paliwo - cotygodniowego świadczenia wypłacanego od października do kwietnia pomagającego pokryć koszty zapotrzebowania na paliwo; Dodatek na paliwo przysługuje osobom pobierającym świadczenie dla poszukujących pracy przez 390 dni, pod warunkiem spełnienia wymogów kwalifikacyjnych

source: Days of unemployment on Jobseeker's Benefit count towards the 390 days if the Jobseeker’s Benefit claim was immediately before the award of Jobseeker’s Allowance
pl: Dni pozostawania bez pracy w czasie pobierania świadczenia dla osób poszukujących pracy liczą się do 390 dni, jeżeli wniosek o świadczenie dla osób poszukujących pracy został złożony tuż przed przyznaniem zasiłku dla osób poszukujących pracy

source: • Back to School Clothing and Footwear Allowance - a payment to help with the cost of uniforms and footwear for children who are attending school
pl: • zasiłku na zakup odzieży i obuwia szkolnego - świadczenia pomagającego pokryć koszty mundurków szkolnych i obuwia dzieci w wieku szkolnym;

source: • Medical card - if your income is below a certain level, you may get a medical card
pl: • karty medycznej - jeżeli uzyskiwany dochód jest poniżej określonego poziomu, można ubiegać się o kartę medyczną

source: You do not qualify for the Household Benefits Package or Free Travel with Jobseeker’s Allowance
pl: Osoba pobierająca zasiłek dla poszukujących pracy nie kwalifikuje się do otrzymania pakietu świadczeń na prowadzenie gospodarstwa domowego ani nie jest uprawniona do bezpłatnych przejazdów

source: If your claim is linked to a previous claim for Jobseeker's Allowance, you may be paid for the first 3 days
pl: Wnioski o zapomogę dla osób poszukujących pracy należy składać pierwszego dnia po utracie pracy

source: If you make a late claim, it may be backdated if you provide good evidence for the delay
pl: Ważne jest, aby złożyć wniosek pierwszego dnia po utracie pracy, ponieważ zapomoga nie będzie wypłacana przez pierwsze trzy dni od momentu złożenia wniosku

source: Jobseeker's Allowance application forms are available online
pl: Formularze wniosków o zapomogę dla osób poszukujących pracy są dostępne online

source: You can also get an application form from your Intreo Centre or Social Welfare Branch Office
pl: Formularze można otrzymać również w lokalnym urzędzie pomocy społecznej

source: You will need to bring certain documents with you when you apply for Jobseeker's Allowance
pl: Należy przynieść dokumenty potwierdzające zasadność wniosku i dane

source: You can get help with filling in your application form at your Intreo Centre, Social Welfare Branch Office or nearest Citizens Information Centre
pl: w nim zawarte. Wykaz dokumentów wymaganych przy ubieganiu się o zapomogę dla osób poszukujących pracy

source: More information is available in our document about signing on for the first time
pl: Pomoc w wypełnianiu formularza można uzyskać w lokalnym urzędzie pomocy społecznej lub najbliższym Centrum Porad Obywatelskich

source: If you think you have been wrongly refused Jobseeker's Allowance you can appeal the decision to the Social Welfare Appeals Office
pl: Więcej informacji na temat ubiegania się o zapomogę dla osób poszukujących pracy znajduje się w dokumencie pierwsza rejestracja

source: You should apply for Jobseeker's Allowance to your Intreo Centre or Social Welfare Branch Office
pl: Wnioski o zapomogę dla osób poszukujących pracy należy składać w miejscowym urzędzie opieki społecznej
